"use client";
import Image from "next/image";
import { usePathname } from "next/navigation";

export default function HowWeWork() {
  const pathname = usePathname();

  // Определяем цвет в зависимости от страницы
  const getIconColor = () => {
    switch (pathname) {
      case "/config":
        return "#3F99D0"; // Конфигуратор - голубой
      case "/services":
        return "#1DE9B6"; // Услуги - зеленый
      case "/":
        return "#755CC2"; // Готовые ПК - синий
      default:
        return "#755CC2"; // Дефолтный фиолетовый
    }
  };

  const iconColor = getIconColor();
  return (
    <div className="w-full mx-auto justify-center flex">
      <div className="w-[400px] 2xl:w-[1440px] md:w-[768px] lg:w-[1024px] rounded-t-4xl bg-[#0B0B0B] mt-[48px] h-[670px] custom-346:h-[600px] md:h-[420px] lg:h-[318px]">
        <h2 className="text-xl pt-[46px] pl-[36px] md:pt-[46px] mb-8">
          Как мы работаем
        </h2>
        <ul className="px-[36px] md:columns-2 md:justify-between lg:flex lg:gap-10">
          <li className="mb-6 max-w-[300px] md:h-[100px]">
            <div className="flex gap-3">
              <svg
                width="18"
                height="21"
                viewBox="0 0 18 21"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M12.7925 18C13.5775 18 14.2138 17.3284 14.2138 16.5C14.2138 15.6716 13.5775 15 12.7925 15C12.0075 15 11.3711 15.6716 11.3711 16.5C11.3711 17.3284 12.0075 18 12.7925 18Z"
                  fill={iconColor}
                />
                <path
                  d="M12.7915 21C11.9481 21 11.1237 20.7361 10.4224 20.2416C9.72121 19.7471 9.17467 19.0443 8.85193 18.2221C8.52919 17.3998 8.44475 16.495 8.60928 15.6221C8.77381 14.7492 9.17993 13.9474 9.77628 13.318C10.3726 12.6887 11.1324 12.2601 11.9596 12.0865C12.7867 11.9128 13.6441 12.0019 14.4233 12.3425C15.2024 12.6831 15.8684 13.2599 16.3369 13.9999C16.8055 14.74 17.0556 15.61 17.0556 16.5C17.0543 17.693 16.6046 18.8368 15.8052 19.6804C15.0058 20.5241 13.922 20.9986 12.7915 21ZM12.7915 13.5C12.2292 13.5 11.6796 13.6759 11.2121 14.0056C10.7446 14.3352 10.3803 14.8038 10.1651 15.352C9.94995 15.9001 9.89365 16.5033 10.0033 17.0853C10.113 17.6672 10.3838 18.2018 10.7813 18.6213C11.1789 19.0409 11.6854 19.3266 12.2369 19.4424C12.7883 19.5581 13.3599 19.4987 13.8793 19.2716C14.3988 19.0446 14.8427 18.6601 15.1551 18.1667C15.4675 17.6734 15.6342 17.0933 15.6342 16.5C15.6333 15.7047 15.3335 14.9422 14.8005 14.3798C14.2676 13.8174 13.5451 13.501 12.7915 13.5Z"
                  fill={iconColor}
                />
                <path
                  d="M7.10685 19.5003H1.42137V1.50034H7.10685V6.00034C7.10798 6.3978 7.25809 6.77865 7.52441 7.05969C7.79072 7.34074 8.1516 7.49916 8.52822 7.50034H12.7923V9.75034H14.2137V6.00034C14.2162 5.90178 14.1985 5.80381 14.1617 5.71317C14.1248 5.62254 14.0699 5.54141 14.0005 5.47534L9.02571 0.225345C8.96341 0.151743 8.88658 0.0934517 8.80063 0.0545771C8.71467 0.0157025 8.62169 -0.00280956 8.52822 0.000344965H1.42137C1.04475 0.00153201 0.683868 0.159948 0.417553 0.440996C0.151237 0.722044 0.00112482 1.10289 0 1.50034V19.5003C0.00112482 19.8978 0.151237 20.2786 0.417553 20.5597C0.683868 20.8407 1.04475 20.9992 1.42137 21.0003H7.10685V19.5003ZM8.52822 1.80034L12.5081 6.00034H8.52822V1.80034Z"
                  fill={iconColor}
                />
              </svg>
              <p className="text-base">Заявка</p>
            </div>
            <p className="text-sm mt-2">
              Наши менеджеры всегда учтут ваши пожелания и подберут оптимальную
              конфигурацию
            </p>
          </li>
          <li className="mb-6 max-w-[300px] md:h-[100px]">
            <div className="flex gap-3">
              <svg
                width="20"
                height="20"
                viewBox="0 0 20 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M7.90609 5.06848C8.07938 5.24522 8.17645 5.48287 8.17645 5.73039C8.17645 5.97791 8.07938 6.21556 7.90609 6.3923L6.39362 7.90482C6.21689 8.07811 5.97924 8.17518 5.73173 8.17518C5.48421 8.17518 5.24657 8.07811 5.06983 7.90482L2.52608 5.362C2.03191 4.86881 1.2013 5.02955 1.0825 5.71741C0.927264 6.61769 0.991754 7.54213 1.27048 8.41213C1.54921 9.28213 2.03393 10.0719 2.68342 10.7144C3.3329 11.3568 4.12794 11.8329 5.0009 12.1021C5.87387 12.3713 6.79894 12.4257 7.69744 12.2606C8.51608 12.1109 9.4016 12.2387 9.98961 12.8257L15.5463 18.3836C15.7312 18.576 15.9527 18.7297 16.1977 18.8355C16.4427 18.9413 16.7064 18.9972 16.9733 18.9999C17.2402 19.0026 17.5049 18.952 17.752 18.8511C17.9991 18.7502 18.2235 18.601 18.4123 18.4123C18.601 18.2235 18.7502 17.999 18.8511 17.7519C18.952 17.5049 19.0026 17.2401 18.9999 16.9732C18.9972 16.7063 18.9413 16.4427 18.8355 16.1976C18.7297 15.9526 18.5761 15.7312 18.3836 15.5462L12.8259 9.98938C12.2389 9.40135 12.1111 8.51481 12.2608 7.69716C12.4254 6.79871 12.3707 5.87381 12.1013 5.00105C11.8319 4.12828 11.3558 3.33344 10.7135 2.68405C10.0712 2.03466 9.28164 1.54993 8.41189 1.27102C7.54214 0.992116 6.61792 0.927287 5.71775 1.08204C5.0299 1.20185 4.86917 2.03148 5.36234 2.52567L7.90609 5.06848Z"
                  stroke={iconColor}
                  strokeWidth="1.5"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                />
              </svg>
              <p className="text-base">Cборка</p>
            </div>
            <p className="text-sm mt-2">
              Наши технические специалисты учтут любые ваши пожелания и
              произведут качественную сборку.
            </p>
          </li>
          <li className="mb-6 max-w-[300px] md:h-[100px]">
            <div className="flex gap-3">
              <svg
                width="19"
                height="20"
                viewBox="0 0 19 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M5.25 19H13.75"
                  stroke={iconColor}
                  strokeWidth="2"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                />
                <path
                  d="M1 13.8571V2.71429C1 2.25963 1.17911 1.82359 1.49792 1.5021C1.81673 1.18061 2.24913 1 2.7 1H16.3C16.7509 1 17.1833 1.18061 17.5021 1.5021C17.8209 1.82359 18 2.25963 18 2.71429V13.8571C18 14.3118 17.8209 14.7478 17.5021 15.0693C17.1833 15.3908 16.7509 15.5714 16.3 15.5714H2.7C2.24913 15.5714 1.81673 15.3908 1.49792 15.0693C1.17911 14.7478 1 14.3118 1 13.8571Z"
                  stroke={iconColor}
                  strokeWidth="2"
                />
                <path
                  d="M6.94922 8.2846L8.64922 9.99888L12.0492 6.57031"
                  stroke={iconColor}
                  strokeWidth="2"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                />
              </svg>
              <p className="text-base">Тестирование</p>
            </div>
            <p className="text-sm mt-2">
              Проводим настройку Вашего ПК, после чего менеджеры снимают Вам
              видеоотчет.
            </p>
          </li>
          <li className="mb-6 max-w-[300px] md:h-[100px]">
            <div className="flex gap-3">
              <svg
                width="20"
                height="18"
                viewBox="0 0 20 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <mask
                  id="mask0_2262_2244"
                  style={{ maskType: "luminance" }}
                  maskUnits="userSpaceOnUse"
                  x="0"
                  y="0"
                  width="20"
                  height="18"
                >
                  <path
                    d="M8.11111 12.1085L10.7778 12.9974C10.7778 12.9974 17.4444 11.6641 18.3333 11.6641C19.2222 11.6641 19.2222 12.553 18.3333 13.4418C17.4444 14.3307 14.3333 16.9974 11.6667 16.9974C9 16.9974 7.22222 15.6641 5.44444 15.6641H1"
                    stroke="white"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                  <path
                    d="M1 10.3333C1.88889 9.44444 3.66667 8.11111 5.44444 8.11111C7.22222 8.11111 11.4444 9.88889 12.1111 10.7778C12.7778 11.6667 10.7778 13 10.7778 13M6.33333 5.44444V1.88889C6.33333 1.65314 6.42698 1.42705 6.59368 1.26035C6.76038 1.09365 6.98647 1 7.22222 1H17.8889C18.1246 1 18.3507 1.09365 18.5174 1.26035C18.6841 1.42705 18.7778 1.65314 18.7778 1.88889V9"
                    stroke="white"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                  <path
                    d="M10.332 1H14.7765V5H10.332V1Z"
                    fill="#555555"
                    stroke="white"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                </mask>
                <g mask="url(#mask0_2262_2244)">
                  <path
                    d="M-0.777344 -2.55469H20.556V18.7786H-0.777344V-2.55469Z"
                    fill={iconColor}
                  />
                </g>
              </svg>
              <p className="text-base">Доставка</p>
            </div>
            <p className="text-sm mt-2">
              Доставка до двери со страховкой на полную стоимость Вашего ПК.
            </p>
          </li>
        </ul>
      </div>
    </div>
  );
}
